---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.NotGridName
source: html/a7838760-eed2-597f-a913-ff16a05e18b2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.NotGridName Property

'[Text]' is not a Grid line name

## Syntax (C#)
```csharp
public static FailureDefinitionId NotGridName { get; }
```